{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\akadi\Documents\PhD\Data\Gaza\data_creation.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 8 Apr 2022, 13:37:35
{txt}
{com}. 
. ******************************************************************
. * Fatalities data
. ******************************************************************
. use "fatalities\Pal_FINAL_AUG13_stata13.dta", clear
{txt}
{com}. 
. gen     byte lfs_district1      =       .                               
{txt}(2163 missing values generated)

{com}. replace         lfs_district1   =       1       if      district=="Jenin"
{txt}(200 real changes made)

{com}. replace         lfs_district1   =       2       if      district=="Tubas"
{txt}(35 real changes made)

{com}. replace         lfs_district1   =       3       if      district=="Tulkarm"
{txt}(124 real changes made)

{com}. replace         lfs_district1   =       4       if      district=="Qalqilya"
{txt}(51 real changes made)

{com}. replace         lfs_district1   =       5       if      district=="Salfit"
{txt}(27 real changes made)

{com}. replace         lfs_district1   =       6       if      district=="Nablus"
{txt}(254 real changes made)

{com}. replace         lfs_district1   =       7       if      district=="Ramallah_&_Al-Bireh"
{txt}(140 real changes made)

{com}. replace         lfs_district1   =       8       if      district=="Jerusalem"
{txt}(104 real changes made)

{com}. replace         lfs_district1   =       9       if      district=="Jericho"
{txt}(13 real changes made)

{com}. replace         lfs_district1   =       10      if      district=="bethlehem"
{txt}(76 real changes made)

{com}. replace         lfs_district1   =       11      if      district=="Hebron"
{txt}(163 real changes made)

{com}. replace         lfs_district1   =       12      if      district=="North_Gaza"
{txt}(260 real changes made)

{com}. replace         lfs_district1   =       13      if      district=="Gaza"
{txt}(167 real changes made)

{com}. replace         lfs_district1   =       14      if      district=="Khanyunis"
{txt}(160 real changes made)

{com}. replace         lfs_district1   =       15      if      district=="Deir_Al-Balah"
{txt}(205 real changes made)

{com}. replace         lfs_district1   =       16      if      district=="Rafah"
{txt}(146 real changes made)

{com}. 
. label def lfs_district2 1 "Jenin"      2 "Tubas"                        3 "Tulkarem"            4 "Qualqilya"           5 "Salfit"      6 "Nablus"   /*
> */                       7 "Ramallah"   8 "Jerusalem"           9 "Jericho"                     10 "Bethlehem"          11 "Hebron"             12 "Gaza North/Jabalya" /*
> */                       13 "Gaza City" 14 "Khanyounis"         15 "Deir El-Balah"      16 "Rafah"      
{txt}
{com}. label  val lfs_district1 lfs_district2
{txt}
{com}. drop   district
{txt}
{com}. rename lfs_district1 district
{res}{txt}
{com}. 
. generate quarter = 0
{txt}
{com}. replace quarter = 1 if month >= 1 & month <= 3
{txt}(556 real changes made)

{com}. replace quarter = 2 if month >= 4 & month <= 6
{txt}(538 real changes made)

{com}. replace quarter = 3 if month >= 7 & month <= 9
{txt}(471 real changes made)

{com}. replace quarter = 4 if month >= 10 & month <= 12
{txt}(598 real changes made)

{com}. 
. collapse (sum) minor_fat fat_byciv fat_bysecurity fat_bypalest, by(district quarter year)
{txt}
{com}. drop if year < 1998
{txt}(55 observations deleted)

{com}. drop if year == 2011 & quarter == 3
{txt}(7 observations deleted)

{com}. 
. generate year_quarter = yq(year,quarter)
{txt}
{com}. sort district year_quarter
{txt}
{com}. 
. *a single variable for fatalities
. 
. generate fatalities = fat_byciv + fat_bysecurity + fat_bypalest
{txt}
{com}. 
. 
. *lagged variable for fatalities
. 
. by district: gen fat_lag1 = fatalities[_n-1] if year_quarter==year_quarter[_n-1]+1
{txt}(95 missing values generated)

{com}. replace fat_lag1 = 0 if missing(fat_lag1) & year_quarter > 140
{txt}(95 real changes made)

{com}. 
. drop minor_fat fat_byciv fat_bysecurity fat_bypalest
{txt}
{com}. save "Gaza\Pal_quart.dta", replace
{txt}file Gaza\Pal_quart.dta saved

{com}. 
. ******************************************************************
. * PCPSR public opinion data
. ******************************************************************
. 
. clear
{txt}
{com}. use "Palestinian Public Opinion\Pcpsr\Palestinian Public Opinion dataset\pcbsr_microdata_13.dta", clear
{txt}
{com}. 
. keep year quarter district locality_type sex age_group marital_status educ_level religion occupation sector refugee_status faction_support
{txt}
{com}. 
. tabulate faction_support, generate(faction)

             {txt}Choice for political party {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                                   DFLP {c |}{res}      1,158        0.88        0.88
{txt}                                  Fateh {c |}{res}     50,087       38.04       38.92
{txt}                             h.al-sha'b {c |}{res}        440        0.33       39.26
{txt}                                  Hamas {c |}{res}     20,843       15.83       55.09
{txt}                                   PFLP {c |}{res}      4,944        3.76       58.84
{txt}                                   Fida {c |}{res}        559        0.42       59.27
{txt}                  Independent Islamists {c |}{res}      4,373        3.32       62.59
{txt}               Independent Nationalists {c |}{res}      6,142        4.67       67.25
{txt}                            Independent {c |}{res}        466        0.35       67.61
{txt}                          Islamic Jihad {c |}{res}      3,566        2.71       70.32
{txt}                                 Others {c |}{res}      3,200        2.43       72.75
{txt}                                 No one {c |}{res}     34,458       26.17       98.92
{txt}                                    PPP {c |}{res}        905        0.69       99.61
{txt}                    Independent leftist {c |}{res}         11        0.01       99.62
{txt}national inititiative (almubadara al wa {c |}{res}        383        0.29       99.91
{txt}       third way headed by salam feyyad {c |}{res}        123        0.09      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}    131,658      100.00
{txt}
{com}. 
. rename faction1 DFLP
{res}{txt}
{com}. rename faction2 Fateh
{res}{txt}
{com}. rename faction3 h_al_shab
{res}{txt}
{com}. rename faction4 Hamas
{res}{txt}
{com}. rename faction5 PFLP
{res}{txt}
{com}. rename faction6 Fida
{res}{txt}
{com}. rename faction7 Ind_Islamists
{res}{txt}
{com}. rename faction8 Ind_Nationalists
{res}{txt}
{com}. rename faction9 Independent
{res}{txt}
{com}. rename faction10 Islamic_Jihad
{res}{txt}
{com}. rename faction11 Others
{res}{txt}
{com}. rename faction12 No_one
{res}{txt}
{com}. rename faction13 PPP
{res}{txt}
{com}. rename faction14 Ind_leftist
{res}{txt}
{com}. rename faction15 national_inititiative
{res}{txt}
{com}. rename faction16 third_way
{res}{txt}
{com}. 
. drop if year < 1998 | year > 2011
{txt}(57390 observations deleted)

{com}. drop if year == 2011 & quarter > 2
{txt}(2470 observations deleted)

{com}. 
. generate year_quarter = yq(year,quarter)
{txt}
{com}. sort  district year_quarter
{txt}
{com}. 
. save "Gaza\faction_support.dta", replace
{txt}file Gaza\faction_support.dta saved

{com}. 
. ******************************************************************
. * LFS data
. ******************************************************************
. clear
{txt}
{com}. use "LFS\1995_2013_stata13.dta", clear
{txt}
{com}. 
. gen     lfs_district1   =       .                               
{txt}(1965020 missing values generated)

{com}. replace         lfs_district1   =       1       if      district==1
{txt}(130729 real changes made)

{com}. replace         lfs_district1   =       2       if      district==5
{txt}(54113 real changes made)

{com}. replace         lfs_district1   =       3       if      district==10
{txt}(91910 real changes made)

{com}. replace         lfs_district1   =       4       if      district==20
{txt}(66980 real changes made)

{com}. replace         lfs_district1   =       5       if      district==25
{txt}(55987 real changes made)

{com}. replace         lfs_district1   =       6       if      district==15
{txt}(146171 real changes made)

{com}. replace         lfs_district1   =       7       if      district==30
{txt}(150533 real changes made)

{com}. replace         lfs_district1   =       8       if      district==40
{txt}(152465 real changes made)

{com}. replace         lfs_district1   =       9       if      district==35
{txt}(50856 real changes made)

{com}. replace         lfs_district1   =       10      if      district==45
{txt}(116156 real changes made)

{com}. replace         lfs_district1   =       11      if      district==50
{txt}(259694 real changes made)

{com}. replace         lfs_district1   =       12      if      district==55
{txt}(139141 real changes made)

{com}. replace         lfs_district1   =       13      if      district==60
{txt}(157491 real changes made)

{com}. replace         lfs_district1   =       14      if      district==70
{txt}(132903 real changes made)

{com}. replace         lfs_district1   =       15      if      district==65
{txt}(127554 real changes made)

{com}. replace         lfs_district1   =       16      if      district==75
{txt}(132337 real changes made)

{com}. 
. label def lfs_district2 1 "Jenin"      2 "Tubas"                        3 "Tulkarem"            4 "Qualqilya"           5 "Salfit"      6 "Nablus"   /*
> */                       7 "Ramallah"   8 "Jerusalem"           9 "Jericho"                     10 "Bethlehem"          11 "Hebron"             12 "Gaza North/Jabalya" /*
> */                       13 "Gaza City" 14 "Khanyounis"         15 "Deir El-Balah"      16 "Rafah"     
{txt}
{com}. label  val lfs_district1 lfs_district2
{txt}
{com}. drop   district
{txt}
{com}. rename lfs_district1 district
{res}{txt}
{com}. 
. drop if year > 2011 | year < 1998
{txt}(391162 observations deleted)

{com}. drop if year == 2011 & quarter > 2
{txt}(57660 observations deleted)

{com}. 
. *keep only working age persons (18-64 as in private public wage gaps paper)
. keep if age >= 18 & age <=64
{txt}(543469 observations deleted)

{com}. 
. generate year_quarter = yq(year,quarter)
{txt}
{com}. sort district year_quarter
{txt}
{com}. 
. tab district, gen(ddistrict)

          {txt}district {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
             Jenin {c |}{res}     63,544        6.53        6.53
{txt}             Tubas {c |}{res}     27,752        2.85        9.39
{txt}          Tulkarem {c |}{res}     42,451        4.36       13.75
{txt}         Qualqilya {c |}{res}     33,821        3.48       17.23
{txt}            Salfit {c |}{res}     29,317        3.01       20.24
{txt}            Nablus {c |}{res}     71,153        7.31       27.56
{txt}          Ramallah {c |}{res}     76,145        7.83       35.38
{txt}         Jerusalem {c |}{res}     81,787        8.41       43.79
{txt}           Jericho {c |}{res}     27,345        2.81       46.60
{txt}         Bethlehem {c |}{res}     59,554        6.12       52.72
{txt}            Hebron {c |}{res}    127,053       13.06       65.79
{txt}Gaza North/Jabalya {c |}{res}     63,516        6.53       72.32
{txt}         Gaza City {c |}{res}     74,443        7.65       79.97
{txt}        Khanyounis {c |}{res}     69,188        7.11       87.08
{txt}     Deir El-Balah {c |}{res}     63,848        6.56       93.65
{txt}             Rafah {c |}{res}     61,812        6.35      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}    972,729      100.00
{txt}
{com}. egen district_year_quarter = group(district year_quarter)
{txt}
{com}. 
. *generate labor market indicators
. gen unemployment = empch == 2 if empch ~=.
{txt}
{com}. *note that this is unemployment share of population, not of the labor force
. *gen employment = empch == 1 if empch ~=.
. gen LFP = empch ~= 3 if empch ~=.
{txt}
{com}. 
. *collapse to district_year_quarter level
. collapse unemployment LFP dwage [aw = qweight],by(district quarter year year_quarter district_year_quarter)
{txt}
{com}. *unemployment as share of the labor force
. replace unemployment = unemployment/LFP
{txt}(852 real changes made)

{com}. sort district year_quarter
{txt}
{com}. 
. save "Gaza\socio_econ.dta", replace
{txt}file Gaza\socio_econ.dta saved

{com}. 
. ******************************************************************
. * consumer price index
. ******************************************************************
. 
. clear
{txt}
{com}. import excel "CPI\cpi1996-2015quart.xls", sheet("cpi") firstrow
{res}{txt}
{com}. 
. drop if year > 2011 | year < 1998
{txt}(72 observations deleted)

{com}. drop if year == 2011 & quarter > 2
{txt}(6 observations deleted)

{com}. 
. generate year_quarter = yq(year,quarter)
{txt}
{com}. sort region year_quarter
{txt}
{com}. 
. save "Gaza\cpi.dta", replace
{txt}file Gaza\cpi.dta saved

{com}. 
. ******************************************************************
. * merging files
. ******************************************************************
. 
. *merge cpi into socio-economic indicators and calculate real wages
. 
. use "Gaza\socio_econ.dta", replace
{txt}
{com}. 
. generate region = .
{txt}(852 missing values generated)

{com}. replace region = 1 if district < 12 & district != 8
{txt}(532 real changes made)

{com}. replace region = 2 if district >= 12
{txt}(266 real changes made)

{com}. replace region = 3 if district == 8
{txt}(54 real changes made)

{com}. 
. sort region year_quarter
{txt}
{com}. 
. merge m:1 region year_quarter using "Gaza\cpi.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             852{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. drop region
{txt}
{com}. sort district year_quarter
{txt}
{com}. 
. *real wage
. gen r_dwage = (dwage/cpi)*100
{txt}
{com}. drop dwage
{txt}
{com}. drop cpi
{txt}
{com}. 
. save "Gaza\socio_econ.dta", replace
{txt}file Gaza\socio_econ.dta saved

{com}. 
. *merge fatalities with socio-economic indicators
. use "Gaza\Pal_quart.dta", clear
{txt}
{com}. merge 1:1 district year_quarter using "Gaza\socio_econ.dta"
{res}{txt}{p 0 7 2}
(note: variable
district was 
byte, now float to accommodate using data's values)
{p_end}
(label lfs_district2 already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             339
{txt}{col 9}from master{col 30}{res}              21{txt}  (_merge==1)
{col 9}from using{col 30}{res}             318{txt}  (_merge==2)

{col 5}matched{col 30}{res}             534{txt}  (_merge==3)
{col 5}{hline 41}

{com}. tab _merge

                 {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 24}{c +}{hline 35}
        master only (1) {c |}{res}         21        2.41        2.41
{txt}         using only (2) {c |}{res}        318       36.43       38.83
{txt}            matched (3) {c |}{res}        534       61.17      100.00
{txt}{hline 24}{c +}{hline 35}
                  Total {c |}{res}        873      100.00
{txt}
{com}. *filling zero fatalities
. replace fatalities = 0 if _merge==2
{txt}(318 real changes made)

{com}. replace fat_lag1 = 0 if _merge==2 & year_quarter > 140
{txt}(318 real changes made)

{com}. *ignore missing year-quarter-district clusters for now
. drop if _merge == 1
{txt}(21 observations deleted)

{com}. drop _merge
{txt}
{com}. 
. save "Gaza\fat_and_econ.dta", replace
{txt}file Gaza\fat_and_econ.dta saved

{com}. 
. *merge public opinion to other data
. clear
{txt}
{com}. use "Gaza\faction_support.dta", clear
{txt}
{com}. 
. merge m:1 district year_quarter using "Gaza\fat_and_econ.dta"
{res}{txt}{p 0 7 2}
(note: variable
quarter was 
byte, now float to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           1,032
{txt}{col 9}from master{col 30}{res}             918{txt}  (_merge==1)
{col 9}from using{col 30}{res}             114{txt}  (_merge==2)

{col 5}matched{col 30}{res}          71,806{txt}  (_merge==3)
{col 5}{hline 41}

{com}. tab _merge

                 {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 24}{c +}{hline 35}
        master only (1) {c |}{res}        918        1.26        1.26
{txt}         using only (2) {c |}{res}        114        0.16        1.42
{txt}            matched (3) {c |}{res}     71,806       98.58      100.00
{txt}{hline 24}{c +}{hline 35}
                  Total {c |}{res}     72,838      100.00
{txt}
{com}. keep if _merge==3
{txt}(1032 observations deleted)

{com}. drop _merge
{txt}
{com}. 
. save "Gaza\master_data.dta", replace
{txt}file Gaza\master_data.dta saved

{com}. 
. ******************************************************************
. * data clean-up
. ******************************************************************
. use "Gaza\master_data.dta", clear
{txt}
{com}. 
. *remove respondants below the age of 18
. drop if age_group == 0
{txt}(35 observations deleted)

{com}. 
. *remove respondents with unknown education level
. drop if educ_level == 8
{txt}(198 observations deleted)

{com}. 
. *reomove respondents with missing data
. 
. drop if faction_support == .
{txt}(167 observations deleted)

{com}. drop if age_group == .
{txt}(116 observations deleted)

{com}. drop if locality_type == .
{txt}(1206 observations deleted)

{com}. drop if educ_level == .
{txt}(0 observations deleted)

{com}. drop if sector == .
{txt}(0 observations deleted)

{com}. drop if occupation == .
{txt}(444 observations deleted)

{com}. drop if sex == .
{txt}(54 observations deleted)

{com}. drop if refugee_status == .
{txt}(132 observations deleted)

{com}. drop if marital_status == .
{txt}(0 observations deleted)

{com}. 
. save "Gaza\master_data.dta", replace
{txt}file Gaza\master_data.dta saved

{com}. 
. ******************************************************************
. * create dependent variable
. ******************************************************************
. use "Gaza\master_data.dta", clear
{txt}
{com}. 
. 
. generate moderate = 0
{txt}
{com}. replace moderate = 1 if faction_support == 2 | faction_support == 3 | faction_support == 6 | faction_support ==13 | faction_support == 15 | faction_support == 16
{txt}(25745 real changes made)

{com}. generate militant = 0
{txt}
{com}. replace militant = 1 if faction_support == 1 | faction_support == 4 | faction_support == 5 | faction_support == 7 | faction_support == 8 | faction_support == 10 | faction_support == 10
{txt}(22096 real changes made)

{com}. generate other_fac = 0
{txt}
{com}. replace other_fac = 1 if faction_support == 9 | faction_support == 11 | faction_support == 12
{txt}(21613 real changes made)

{com}. 
. generate mvote = .
{txt}(69454 missing values generated)

{com}. replace mvote = 1 if moderate == 1
{txt}(25745 real changes made)

{com}. replace mvote = 2 if militant == 1
{txt}(22096 real changes made)

{com}. replace mvote = 3 if other_fac == 1
{txt}(21613 real changes made)

{com}. 
. label define mvote 1 moderate, add
{txt}
{com}. label define mvote 2 militant, add
{txt}
{com}. label define mvote 3 other, add
{txt}
{com}. 
. save "Gaza\master_data.dta", replace
{txt}file Gaza\master_data.dta saved

{com}. 
. ******************************************************************
. * create independent variables
. ******************************************************************
. 
. use "Gaza\master_data.dta", clear
{txt}
{com}. 
. *dummy for West Bank (0) and Gaza (1)
. generate gaza = 0
{txt}
{com}. replace gaza = 1 if district > 11
{txt}(25152 real changes made)

{com}. 
. *an indicator for the blockade from 2007q4 to 2010q2
. generate blockade = 0
{txt}
{com}. replace blockade = 1 if year_quarter >= 191 & year_quarter <= 201
{txt}(12479 real changes made)

{com}. generate gaza_blockade = gaza*blockade
{txt}
{com}. 
. *indicators for other Gaza conflicts
. generate cast_lead = 0
{txt}
{com}. replace cast_lead = 1 if year_quarter == 196
{txt}(1253 real changes made)

{com}. generate gaza_lead = gaza*cast_lead
{txt}
{com}. 
. generate hot_winter = 0
{txt}
{com}. replace hot_winter = 1 if year_quarter == 192
{txt}(1255 real changes made)

{com}. generate gaza_winter = gaza*hot_winter
{txt}
{com}. 
. generate battle = 0
{txt}
{com}. replace battle = 1 if year_quarter == 189
{txt}(1247 real changes made)

{com}. generate gaza_battle = gaza*battle
{txt}
{com}. 
. generate clouds = 0
{txt}
{com}. replace clouds = 1 if year_quarter == 187
{txt}(1229 real changes made)

{com}. generate gaza_clouds = gaza*clouds
{txt}
{com}. 
. generate summer = 0
{txt}
{com}. replace summer = 1 if year_quarter >= 186 & year_quarter <= 187
{txt}(2477 real changes made)

{com}. generate gaza_summer = gaza*summer
{txt}
{com}. 
. *general treatment variable
. gen treatment = 0
{txt}
{com}. replace treatment = 1 if blockade == 1 | cast_lead == 1 | hot_winter == 1 | battle == 1 | clouds == 1 | summer == 1
{txt}(16203 real changes made)

{com}. gen gaza_treat = gaza*treatment
{txt}
{com}. 
. *treatment variable for Israeli military operations
. gen operation = 0
{txt}
{com}. replace operation = 1 if cast_lead == 1 | hot_winter == 1 | clouds == 1 | summer == 1
{txt}(4985 real changes made)

{com}. gen gaza_operation = gaza*operation
{txt}
{com}. 
. *time trend variables
. 
. quietly sum year_quarter
{txt}
{com}. generate trend = year_quarter - r(min) + 1
{txt}
{com}. generate trend_sqr = trend^2
{txt}
{com}. generate trend_cube = trend^3
{txt}
{com}. 
. generate gaza_trend = gaza*trend
{txt}
{com}. generate gaza_trend_sqr = gaza*trend_sqr
{txt}
{com}. generate gaza_trend_cube = gaza*trend_cube
{txt}
{com}. 
. save "Gaza\master_data.dta", replace
{txt}file Gaza\master_data.dta saved

{com}. 
. ************ Socio-demographic variables-
. use "Gaza\master_data.dta", clear
{txt}
{com}. 
. gen female=(sex==2 ) if sex~=.
{txt}
{com}. drop sex
{txt}
{com}. 
. tab  marital_status 

  {txt}Marital Status {c |}      Freq.     Percent        Cum.
{hline 17}{c +}{hline 35}
          single {c |}{res}     14,490       20.86       20.86
{txt}         married {c |}{res}     52,574       75.70       96.56
{txt}divorced/widowed {c |}{res}      2,199        3.17       99.72
{txt}           dk/na {c |}{res}        191        0.28      100.00
{txt}{hline 17}{c +}{hline 35}
           Total {c |}{res}     69,454      100.00
{txt}
{com}. gen married=(marital_status==2 ) if marital_status~=.
{txt}
{com}. drop marital_status
{txt}
{com}. 
. tab refugee_status 

    {txt}Refugee {c |}
     Status {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
    refugee {c |}{res}     30,273       43.59       43.59
{txt}non-refugee {c |}{res}     39,181       56.41      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     69,454      100.00
{txt}
{com}. gen refugees=(refugee_status==1 ) if refugee_status~=.
{txt}
{com}. drop refugee_status
{txt}
{com}. 
. save "Gaza\master_data.dta", replace
{txt}file Gaza\master_data.dta saved

{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\akadi\Documents\PhD\Data\Gaza\data_creation.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 8 Apr 2022, 13:37:40
{txt}{.-}
{smcl}
{txt}{sf}{ul off}